ctf/tryhackme/advent-of-cyber-2022.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advent Of Cyber 2022 (TryHackMe)</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/css/default.css' />
<link rel='stylesheet' href='/css/source-code.css' />
</head>
<body>
<div id="preamble" class="status">
<h1 id='site-name'>Bryan Rinders</h1>
<div id='menu'>
  <a href='/html/'>Home</a>
  <a href='/html/ctf/'>CTF WriteUps</a>
  <a href='/html/emacs/'>Emacs</a>
  <a href='/html/linux/'>Linux Tutorials</a>
  <a href='https://gitlab.com/bryos/dotfiles' target='_blank'>Dotfiles</a>
  <a href='/html/other/'>Other</a>
  <span class='right'>
    <a href='/html/sitemap.html'>Sitemap</a>
  </span>
</div>
<br><hr>
</div>
<div id="content">
<h1 class="title">Advent Of Cyber 2022 (TryHackMe)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4074d5c">Day 1 Frameworks</a>
<ul>
<li><a href="#org2ee813e">Puzzle 1</a></li>
<li><a href="#org1b4df1f">Puzzle 2</a></li>
<li><a href="#org466728f">Puzzle 3</a></li>
<li><a href="#orgb636a3c">Answers</a></li>
</ul>
</li>
<li><a href="#org06d4d36">Day 2 Log Analysis</a></li>
<li><a href="#org7d2ceb3">Day 3 OSINT</a></li>
<li><a href="#orgfb4cacc">Day 4 Scanning</a></li>
<li><a href="#org270d653">Day 5 Brute Forcing</a></li>
<li><a href="#orge09390e">Day 6 Email Analysis</a></li>
<li><a href="#org5bd8ab3">Day 7 Cyberchef</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4074d5c" class="outline-2">
<h2 id="org4074d5c">Day 1 Frameworks</h2>
<div class="outline-text-2" id="text-org4074d5c">
</div>
<div id="outline-container-org2ee813e" class="outline-3">
<h3 id="org2ee813e">Puzzle 1</h3>
<div class="outline-text-3" id="text-org2ee813e">
<ol class="org-ol">
<li>Reconnaissance</li>
<li>Weaponization</li>
<li>Delivery</li>
<li>Social Engineering</li>
<li>Exploitation</li>
<li>Persistence</li>
<li>Defence Evasion</li>
<li>Command &amp; Control</li>
</ol>
</div>
</div>

<div id="outline-container-org1b4df1f" class="outline-3">
<h3 id="org1b4df1f">Puzzle 2</h3>
<div class="outline-text-3" id="text-org1b4df1f">
<ol class="org-ol">
<li>Pivoting</li>
<li>Discovery</li>
<li>Priviledge Escalation</li>
<li>Execution</li>
<li>Credential Access</li>
<li>Lateral Movement</li>
</ol>
</div>
</div>

<div id="outline-container-org466728f" class="outline-3">
<h3 id="org466728f">Puzzle 3</h3>
<div class="outline-text-3" id="text-org466728f">
<ol class="org-ol">
<li>Access</li>
<li>Collection</li>
<li>Exfiltration</li>
<li>Impact</li>
<li>Objectivication</li>
</ol>
</div>
</div>

<div id="outline-container-orgb636a3c" class="outline-3">
<h3 id="orgb636a3c">Answers</h3>
<div class="outline-text-3" id="text-orgb636a3c">
<p>
Who is the adversary that attacked Santa's network this year?
</p>

<div class="org-src-container">
<pre class="src src-example">The Bandit Yeti
</pre>
</div>

<p>
What's the flag that they left behind?
</p>

<div class="org-src-container">
<pre class="src src-example">THM{IT'S A Y3T1 CHR1$TMA$}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org06d4d36" class="outline-2">
<h2 id="org06d4d36">Day 2 Log Analysis</h2>
<div class="outline-text-2" id="text-org06d4d36">
<p>
Use the ls command to list the files present in the current directory. How many log files are present?
</p>

<div class="org-src-container">
<pre class="src src-sh">ls .*.log* | wc -l
</pre>
</div>

<p>
Elf McSkidy managed to capture the logs generated by the web server. What is the name of this log file?
</p>

<pre class="example">
webserver.log
</pre>

<p>
On what day was Santa's naughty and nice list stolen?
</p>

<div class="org-src-container">
<pre class="src src-sh">grep <span class="org-string">"santaslist.txt"</span> webserver.log
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d2ceb3" class="outline-2">
<h2 id="org7d2ceb3">Day 3 OSINT</h2>
</div>
<div id="outline-container-orgfb4cacc" class="outline-2">
<h2 id="orgfb4cacc">Day 4 Scanning</h2>
</div>
<div id="outline-container-org270d653" class="outline-2">
<h2 id="org270d653">Day 5 Brute Forcing</h2>
<div class="outline-text-2" id="text-org270d653">
<p>
Use Hydra to find the VNC password of the target with IP address
<b>MACHINE<sub>IP</sub></b>. What is the password?
</p>

<div class="org-src-container">
<pre class="src src-sh">hydra -P /usr/share/wordlists/rockyou.txt MACHINE_IP vnc
</pre>
</div>

<p>
Using a VNC client on the AttackBox, connect to the target of IP
address MACHINE<sub>IP</sub>. What is the flag written on the target’s screen?
</p>

<p>
When using an attackbox open Remmina from Application &gt; Internet &gt;
Remmina. Click cancel when asked to unlock your keyring. Then select
the VNC protocol on the top left corner and type the <b>MACHINE<sub>IP</sub></b> in
the search bar. Use the password found in the previous question when
asked for a password. Finally you'll see a screen with the flag.
</p>

<pre class="example">
THM{I_SEE_YOUR_SCREEN}
</pre>
</div>
</div>

<div id="outline-container-orge09390e" class="outline-2">
<h2 id="orge09390e">Day 6 Email Analysis</h2>
</div>
<div id="outline-container-org5bd8ab3" class="outline-2">
<h2 id="org5bd8ab3">Day 7 Cyberchef</h2>
</div>
</div>
<div id="postamble" class="status">
<br><hr/>
<footer>
  <div class='copyright-container'>
    <div class='copyright'>
      Copyright &copy; 2022-2023 Bryan Rinders some rights reserved
      <br><br>
      This page is available under a
      <a rel='license' href='http://creativecommons.org/licenses/by/4.0/'>
        CC-BY 4.0
      </a> licence.
    </div>
  </div>
  <br>
  <div class='generated'>
    Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3) on <a href='https://www.gnu.org'>GNU</a>/<a href='https://www.kernel.org/'>Linux</a>
  </div>
</footer>
</div>
</body>
</html>
